Tekla.Structures.ModelInternal.dotGridPlane_t
Struct for the GridSurface


Tekla.Structures.ModelInternal.dotGridPlane_t.Plane
The plane

Tekla.Structures.ModelInternal.dotGridPlane_t.FatherId
ID of the father grid

Tekla.Structures.ModelInternal.dotGridPlane_t.aLabel
The Label of the GridSurface

Tekla.Structures.ModelInternal.dotGridPlane_t.Color
Determines the Color of the GridSurface. This works only in wireframe views.

Tekla.Structures.ModelInternal.dotGridPlane_t.IsMagnetic
Determines if the Plane is Magnetic or not

Tekla.Structures.ModelInternal.dotGridPlane_t.ExtensionForMagneticArea
Extension for magnetic area

Tekla.Structures.ModelInternal.dotGridPlane_t.ExtensionLeft
Line extension left

Tekla.Structures.ModelInternal.dotGridPlane_t.ExtensionRight
Line extension right

Tekla.Structures.ModelInternal.dotGridPlane_t.ExtensionBelow
Line extension below

Tekla.Structures.ModelInternal.dotGridPlane_t.ExtensionAbove
Line extension above

Tekla.Structures.ModelInternal.dotGridPlane_t.Radius
Radius of the cylindrical surface

Tekla.Structures.ModelInternal.dotGridPlane_t.Angle
Angle subtended by the cylindrical section

Tekla.Structures.ModelInternal.dotGridPlane_t.DrawingVisibility
Determines if the GridSurface is visible in drawings or not

Tekla.Structures.ModelInternal.dotGridPlane_t.IsManual
Determines if the plane was manually created.