Tekla.Structures.ModelInternal.dotGrid_t
Struct for the Grid


Tekla.Structures.ModelInternal.dotGrid_t.aCoordinateX
Coordinates for the X-axes

Tekla.Structures.ModelInternal.dotGrid_t.aCoordinateY
Coordinates for the Y-axes

Tekla.Structures.ModelInternal.dotGrid_t.aCoordinateZ
Coordinates for the Z-axes

Tekla.Structures.ModelInternal.dotGrid_t.aLabelX
Labels for the X-axes

Tekla.Structures.ModelInternal.dotGrid_t.aLabelY
Labels for the Y-axes

Tekla.Structures.ModelInternal.dotGrid_t.aLabelZ
Labels for the Z-axes

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionLeftX
Extension to left X-axis

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionLeftY
Extension to left Y-axis

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionLeftZ
Extension to left Z-axis

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionRightX
Extension to right X-axis

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionRightY
Extension to right Y-axis

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionRightZ
Extension to right Z-axis

Tekla.Structures.ModelInternal.dotGrid_t.IsMagnetic
Determines if the Grid is Magnetic or not

Tekla.Structures.ModelInternal.dotGrid_t.ExtensionForMagneticArea
Extension for magnetic area

Tekla.Structures.ModelInternal.dotGrid_t.Color
Determines the Color of the Grid.

Tekla.Structures.ModelInternal.dotGrid_t.FontSize
Font size of the labels

Tekla.Structures.ModelInternal.dotGrid_t.FontColor
Font color of the labels

Tekla.Structures.ModelInternal.dotGrid_t.Origin
Origin of the grid

Tekla.Structures.ModelInternal.dotGrid_t.Name
Name of the grid