Tekla.Structures.ModelInternal.dotAssembly_t
Struct for the Assembly.


Tekla.Structures.ModelInternal.dotAssembly_t.AssemblableId
The Identifier for the Assemblable we wish to find out the Assembly for (or 0 if none)

Tekla.Structures.ModelInternal.dotAssembly_t.MainPart
The Main Part of the Assembly.

Tekla.Structures.ModelInternal.dotAssembly_t.Type
The type of the Assembly.

Tekla.Structures.ModelInternal.dotAssembly_t.nAssemblyOtherParts
The number of secondary assemblables in the Assembly

Tekla.Structures.ModelInternal.dotAssembly_t.nAssemblySubAssemblies
Number of subassmblies.

Tekla.Structures.ModelInternal.dotAssembly_t.MainAssembly
The main assembly ID (if any) for this assembly

Tekla.Structures.ModelInternal.dotAssembly_t.NumberingSeries
Numbering of assembly

Tekla.Structures.ModelInternal.dotAssembly_t.aName
Name of the assembly

Tekla.Structures.ModelInternal.dotAssembly_t.ClientID
