Tekla.Structures.ModelInternal.dotRebarSet_t
Struct for the Rebar set.


Tekla.Structures.ModelInternal.dotRebarSet_t.RebarProperties
The default rebar properties.

Tekla.Structures.ModelInternal.dotRebarSet_t.Offsets
The offsets.

Tekla.Structures.ModelInternal.dotRebarSet_t.LayerOrderNumber
The layer order number.

Tekla.Structures.ModelInternal.dotRebarSet_t.NumberLegFaces
The number of legfaces

Tekla.Structures.ModelInternal.dotRebarSet_t.NumberGuidelines
The number of guidelines.

Tekla.Structures.ModelInternal.dotRebarSet_t.NumberContourPoints
The overall number of contour points used in the rebar set.

Tekla.Structures.ModelInternal.dotRebarSet_t.NumberSpacingZones
The total number of spacing zones for all guidelines in the rebar set.

Tekla.Structures.ModelInternal.dotRebarSet_t.OrientationStart
The orientation line start point.

Tekla.Structures.ModelInternal.dotRebarSet_t.OrientationEnd
The orientation line start point.

Tekla.Structures.ModelInternal.dotRebarSet_t.FatherPartId
The father part ID.

Tekla.Structures.ModelInternal.dotRebarSet_t.CloseShape
The close shape flag.

Tekla.Structures.ModelInternal.dotRebarSet_t.FrozenState
The forzen state.