Tekla.Structures.ModelInternal.dotHierarchicObject_t
Serialization structure for hierarchical definition.


Tekla.Structures.ModelInternal.dotHierarchicObject_t.OperationType
Operation type.

Tekla.Structures.ModelInternal.dotHierarchicObject_t.aName
Name of the hierarchical definition.

Tekla.Structures.ModelInternal.dotHierarchicObject_t.Type
Type of the hierarchical object.

Tekla.Structures.ModelInternal.dotHierarchicObject_t.Definition
The hierarchical definition that this object is an instance of.

Tekla.Structures.ModelInternal.dotHierarchicObject_t.Parent
Id of the Father object.

Tekla.Structures.ModelInternal.dotHierarchicObject_t.nSubHierarchyIds
How many objects the hierarchical definition has.

Tekla.Structures.ModelInternal.dotHierarchicObject_t.aSubHierarchyIds
Array that contains object ids of the hierarchical definition.