Tekla.Structures.ModelInternal.dotHierarchicDefinition_t
Serialization structure for hierarchical definition.


Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.OperationType
Operation type.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.aName
Name of the hierarchical definition.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.aCustomType
Custom type of the hierarchical definition.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.aHierarchyIdentifier
Guid of the hierarchical definition.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.HierarchyType
Definition type.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.Drawable
Defines if the definition is a drawable area in the model.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.ObjectParent
Id of the Father object.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.nSubHierarchyIds
How many objects the hierarchical definition has.

Tekla.Structures.ModelInternal.dotHierarchicDefinition_t.aSubHierarchyIds
Array that contains object ids of the hierarchical definition.