Tekla.Structures.ModelInternal.dotTask_t
Serialization structure for task.


Tekla.Structures.ModelInternal.dotTask_t.aName
Name of the task.

Tekla.Structures.ModelInternal.dotTask_t.Completeness
Percentage of completeness of the task on the scale from 0 to 100.

Tekla.Structures.ModelInternal.dotTask_t.Critical
Criticality of the task.

Tekla.Structures.ModelInternal.dotTask_t.Local
Locality indicates if the task was created in Tekla Structures and Task Manager or imported.

Tekla.Structures.ModelInternal.dotTask_t.Scenario
The scenario which the task belongs to.

Tekla.Structures.ModelInternal.dotTask_t.aDescription
Description of the task.

Tekla.Structures.ModelInternal.dotTask_t.aUrl
Link to a location or document containing information of the task.

Tekla.Structures.ModelInternal.dotTask_t.PlannedStartDate
Planned start date of the task.

Tekla.Structures.ModelInternal.dotTask_t.PlannedEndDate
Planned end date of the task.

Tekla.Structures.ModelInternal.dotTask_t.PlannedWorkAmount
Planned work amount in hours

Tekla.Structures.ModelInternal.dotTask_t.ActualStartDate
Actual start date of the task.

Tekla.Structures.ModelInternal.dotTask_t.ActualEndDate
Actual end date of the task.

Tekla.Structures.ModelInternal.dotTask_t.ActualWorkAmount
Actual work amount in hours