Tekla.Structures.ModelInternal.dotSurfaceTreatment_t
Struct for the Surface Treatment


Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.Type
Which Surfacing type the object is.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.Color
Which colour the Surfacing has.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.Material
Defines the Material for the Surface Treatment.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.Position
Defines the Position for the Surface Treatment.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.StartPoint
The StartPoint determines the origin of the Surfacing, it is then filled out from
here towards the EndPoint.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.EndPoint
Determines the direction the Surfacing is filled in, the direction is from the StartPoint
towards the EndPoint.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.Father
Defines the Father part for the SurfaceTreatment, the part that we create the SurfaceTreatment on.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.Thickness
Defines how thick the SurfaceTreatment is.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.aName
The name of the Surface Treatment.

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.aClass
Class

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.aTypeName
Type name

Tekla.Structures.ModelInternal.dotSurfaceTreatment_t.CutByFatherBooleans
Defines if the part is cut by the father's cuts.
Remarks: It doesn't support polygon cuts.