Tekla.Structures.ModelInternal.dotWeld_t
Struct for the BaseWeld Object.


Tekla.Structures.ModelInternal.dotWeld_t.MainObject
Defines the main part of the Weld.

Tekla.Structures.ModelInternal.dotWeld_t.SecondaryObject
Defines the secondary part of the Weld.

Tekla.Structures.ModelInternal.dotWeld_t.SizeAbove
Defines the Size Above.

Tekla.Structures.ModelInternal.dotWeld_t.AdditionalSizeAbove
Defines the additional size above for combination welds.

Tekla.Structures.ModelInternal.dotWeld_t.TypeAbove
Defines the Type Above.

Tekla.Structures.ModelInternal.dotWeld_t.AngleAbove
Defines the Angle Above.

Tekla.Structures.ModelInternal.dotWeld_t.ContourAbove
Defines the Contour Above.

Tekla.Structures.ModelInternal.dotWeld_t.FinishAbove
Defines the Finish Above.

Tekla.Structures.ModelInternal.dotWeld_t.LengthAbove
Defines the Length Above.

Tekla.Structures.ModelInternal.dotWeld_t.PitchAbove
Defines the Pitch Above.

Tekla.Structures.ModelInternal.dotWeld_t.IncrementAmountAbove
Defines the weld increment amount above.

Tekla.Structures.ModelInternal.dotWeld_t.SizeBelow
Defines the Size Below.

Tekla.Structures.ModelInternal.dotWeld_t.AdditionalSizeBelow
Defines the additional size below for combination welds.

Tekla.Structures.ModelInternal.dotWeld_t.TypeBelow
Defines the Type Below.

Tekla.Structures.ModelInternal.dotWeld_t.AngleBelow
Defines the Angle Below.

Tekla.Structures.ModelInternal.dotWeld_t.ContourBelow
Defines the Contour Below.

Tekla.Structures.ModelInternal.dotWeld_t.FinishBelow
Defines the Finish Below.

Tekla.Structures.ModelInternal.dotWeld_t.LengthBelow
Defines the Length Below.

Tekla.Structures.ModelInternal.dotWeld_t.PitchBelow
Defines the Pitch Below.

Tekla.Structures.ModelInternal.dotWeld_t.IncrementAmountBelow
Defines the weld increment amount below.

Tekla.Structures.ModelInternal.dotWeld_t.aReferenceText
Defines the Reference Text.

Tekla.Structures.ModelInternal.dotWeld_t.ShopWeld
Defines whether it is a Shop Weld or a Site Weld.
If true then it is a Shop Weld.
If false then it is a Site Weld.

Tekla.Structures.ModelInternal.dotWeld_t.AroundWeld
Defines whether it is an Around Weld or an Edge Weld.
If true then it is an Around Weld.
If false then it is an Edge Weld.

Tekla.Structures.ModelInternal.dotWeld_t.RootOpeningAbove
Defines the Root Opening Above.

Tekla.Structures.ModelInternal.dotWeld_t.Position
Defines the Position. For more accurate control use Direction(preferred).

Tekla.Structures.ModelInternal.dotWeld_t.Direction
Defines the Weld edge search direction. Overrides Position if set.

Tekla.Structures.ModelInternal.dotWeld_t.StitchWeld
Defines if it is Stitch Weld or not.

Tekla.Structures.ModelInternal.dotWeld_t.RootFaceAbove
Defines the Root Face Above.

Tekla.Structures.ModelInternal.dotWeld_t.EffectiveThroatAbove
Defines the Effective Throat Above.

Tekla.Structures.ModelInternal.dotWeld_t.PrefixAboveLine
Defines the Size Prefix Above Line.

Tekla.Structures.ModelInternal.dotWeld_t.PrefixBelowLine
Defines the Size Prefix Below Line.

Tekla.Structures.ModelInternal.dotWeld_t.Standard
Defines the Weld Detail/Standard.

Tekla.Structures.ModelInternal.dotWeld_t.ElectrodeClassification
Defines the Weld Classification.

Tekla.Structures.ModelInternal.dotWeld_t.ElectrodeStrength
Defines the Electrode Strength.

Tekla.Structures.ModelInternal.dotWeld_t.ElectrodeCoefficient
Defines the Electrode Strength Coefficient.

Tekla.Structures.ModelInternal.dotWeld_t.ProcessType
Defines the Process Type.

Tekla.Structures.ModelInternal.dotWeld_t.NDTInspection
Defines the NDT Inspection Level.

Tekla.Structures.ModelInternal.dotWeld_t.LogicalWeld
Defines the children welds of a Logical Weld

Tekla.Structures.ModelInternal.dotWeld_t.WeldNumber
Defines the Weld Number.

Tekla.Structures.ModelInternal.dotWeld_t.WeldNumberPrefix
Defines the Weld Number Prefix.

Tekla.Structures.ModelInternal.dotWeld_t.ConnectAssemblies
Defines connect as secondary part (false) or as sub-assembly (true).

Tekla.Structures.ModelInternal.dotWeld_t.LogicalWeldID
Defines the Logical Weld ID. Is equal to 0 if Weld is not Child.

Tekla.Structures.ModelInternal.dotWeld_t.RootOpeningBelow
Defines the Root Opening Below.

Tekla.Structures.ModelInternal.dotWeld_t.RootFaceBelow
Defines the Root Face Below.

Tekla.Structures.ModelInternal.dotWeld_t.EffectiveThroatBelow
Defines the Effective Throat Below.

Tekla.Structures.ModelInternal.dotWeld_t.IntermittentType
Defines the weld intermittent type (Enum).

Tekla.Structures.ModelInternal.dotWeld_t.Placement
Defines the weld placement (Enum).

Tekla.Structures.ModelInternal.dotWeld_t.Preparation
Defines the weld preparation (Enum).

Tekla.Structures.ModelInternal.dotWeld_t.ClientId
Defines weld client id