Tekla.Structures.ModelInternal.dotReferenceModel_t
Struct for the ReferenceModel


Tekla.Structures.ModelInternal.dotReferenceModel_t.Position
The reference models position from model origin / base point origin.

Tekla.Structures.ModelInternal.dotReferenceModel_t.aFilename
Filename of the Reference Model

Tekla.Structures.ModelInternal.dotReferenceModel_t.aActiveFilePath
The path to the local copy of the current revision of the reference model.

Tekla.Structures.ModelInternal.dotReferenceModel_t.aTitle
Name(title) of the Reference Model

Tekla.Structures.ModelInternal.dotReferenceModel_t.Scale
Scale of the Reference Model

Tekla.Structures.ModelInternal.dotReferenceModel_t.Visibility
Visibility of the Reference Model

Tekla.Structures.ModelInternal.dotReferenceModel_t.UseWorkplane
If workplane is used.

Tekla.Structures.ModelInternal.dotReferenceModel_t.aBasePointGuid
The base point guid.

Tekla.Structures.ModelInternal.dotReferenceModel_t.Rotation
The rotation value in degrees.

Tekla.Structures.ModelInternal.dotReferenceModel_t.AxisX_X
Axis vector component.

Tekla.Structures.ModelInternal.dotReferenceModel_t.AxisX_Y
Axis vector component.

Tekla.Structures.ModelInternal.dotReferenceModel_t.AxisX_Z
Axis vector component.

Tekla.Structures.ModelInternal.dotReferenceModel_t.AxisY_X
Axis vector component.

Tekla.Structures.ModelInternal.dotReferenceModel_t.AxisY_Y
Axis vector component.

Tekla.Structures.ModelInternal.dotReferenceModel_t.AxisY_Z
Axis vector component.