Tekla.Structures.ModelInternal.dotRebarSetAddition_t
Struct for the Rebar set addition.


Tekla.Structures.ModelInternal.dotRebarSetAddition_t.FatherId
ID of the father RebarSet.

Tekla.Structures.ModelInternal.dotRebarSetAddition_t.NumberLegFaces
The number of legfaces

Tekla.Structures.ModelInternal.dotRebarSetAddition_t.NumberContourPoints
The overall number of contour points used in the rebar set addition.