Tekla.Structures.ModelInternal.dotPourObject_t
Struct for the Pour object.


Tekla.Structures.ModelInternal.dotPourObject_t.Class


Tekla.Structures.ModelInternal.dotPourObject_t.PourNumber


Tekla.Structures.ModelInternal.dotPourObject_t.PourType


Tekla.Structures.ModelInternal.dotPourObject_t.ConcreteMixture
